# **184. Department Highest Salary**
``` console
Table: Employee
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |
+--------------+---------+

id is the primary key (column with unique values) for this table.
departmentId is a foreign key (reference columns) of the ID from the Department table.
Each row of this table indicates the ID, name, and salary of an employee. It also contains the ID of their department.
 

Table: Department
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+

id is the primary key (column with unique values) for this table. It is guaranteed that department name is not NULL.
Each row of this table indicates the ID of a department and its name.
 

Write a solution to find employees who have the highest salary in each of the departments.

Return the result table in any order.

The result format is in the following example.


Example 1:

Input: 
Employee table:
+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Jim   | 90000  | 1            |
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |
+----+-------+--------+--------------+

Department table:
+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
| 2  | Sales |
+----+-------+

Output: 
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Jim      | 90000  |
| Sales      | Henry    | 80000  |
| IT         | Max      | 90000  |
+------------+----------+--------+

Explanation: Max and Jim both have the highest salary in the IT department and Henry has the highest salary in the Sales department.
```

**Solutions**

In [ ]:
WITH CTE AS(
    SELECT e1.name AS Employee, e1.salary, d.name AS Department,
    DENSE_RANK() OVER(PARTITION BY d.name ORDER BY e1.salary DESC) AS rnk
    FROM Employee e1
    INNER JOIN Department d
    ON e1.departmentId = d.id
)

SELECT Department, Employee, Salary
FROM CTE
WHERE rnk = 1

In [ ]:
SELECT dp.name AS Department, em.name AS Employee, em.salary
FROM Employee AS em 
INNER JOIN Department AS dp 
ON em.departmentId = dp.id 
WHERE em.salary = ( SELECT MAX(salary) FROM Employee WHERE departmentId = dp.id )

In [ ]:
SELECT Department.name AS Department ,Employee.name AS Employee, Employee.salary
FROM Department  
INNER JOIN Employee  
ON Employee.departmentId = Department.id 
WHERE(departmentId, salary) IN
(SELECT departmentId,MAX(salary) FROM Employee GROUP BY departmentId) ;